# IfcExportElementType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcExportElementType Property
ParameterTypeId Class See Also
---
"Export Type to IFC"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcExportElementType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcExportElementType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcExportElementType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace